Long-Beach-Rocketry/Long-Beach-Rocketry-25-26/common/drivers/platform/stm32l4/st_spi.h
/**
 * @file st_spi.h
 * @author Kent Hong
 * @brief SPI Driver library for STM32l4xx
 * @version 0.1
 * @date 2025-09-28
 *
 * @copyright Copyright (c) 2025
 *
 */

#pragma once

#include <stdbool.h>
#include <cstdint>
#include "spi.h"
#include "stm32l476xx.h"

namespace LBR
{
namespace Stml4
{

/**
 * @brief SPI Clock Baud Rate setting where FPCLK_n is the peripheral clock
 * frequency / n
 *
 */
enum class SpiBaudRate : uint8_t
{
    FPCLK_2 = 0,
    FPCLK_4,
    FPCLK_8,
    FPCLK_16,
    FPCLK_32,
    FPCLK_64,
    FPCLK_128,
    FPCLK_256
};

/**
 * @brief SPI bus mode setting
 *        MODE1 = CPOL - 0 and CPHA - 0
 *        MODE2 = CPOL - 0 and CPHA - 1
 *        MODE3 = CPOL - 1 and CPHA - 0
 *        MODE4 = CPOL - 1 and CPHA - 1
 *
 */
enum class SpiBusMode : uint8_t
{
    MODE1 = 0,
    MODE2,
    MODE3,
    MODE4
};

/**
 * @brief Receive Most Significant Bit or Least Significant Bit through data
 * transfer
 *
 */
enum class SpiBitOrder : uint8_t
{
    MSB = 0,
    LSB
};

/**
 * @brief FIFO Rx Threshold determines how many bits in the RX buffer triggers
 * an RXNE event (new data is ready to be read)
 *
 */
enum class SpiRxThreshold : uint8_t
{
    FIFO_16bit = 0,
    FIFO_8bit
};

/**
 * @brief SPI status codes for error checking
 *
 */
enum class SpiStatus : uint8_t
{
    OK = 0,
    READ_ERR,
    WRITE_ERR,
    TRANSFER_ERR,
    INIT_ERR
};

/**
 * @brief Desired SPI control register settings
 *
 */
struct StSpiSettings
{
    SpiBaudRate baudrate;
    SpiBusMode busmode;
    SpiBitOrder order;
    SpiRxThreshold threshold;
};

class HwSpi : public Spi
{
    friend bool ValidateSpi(HwSpi& spi);

public:
    explicit HwSpi(SPI_TypeDef* instance_, StSpiSettings& settings_);

    // Member Functions
    bool Init();
    // TODO: implement read, write, and transfer for SPI
    bool Read();
    bool Write(uint16_t output_data);
    bool Transfer(uint16_t output_data);

private:
    // Member variables
    SPI_TypeDef* instance;
    StSpiSettings settings;

    // Private Member Functions
    static inline void SetReg(volatile uint32_t* reg, uint32_t enum_val,
                              uint32_t bit_num, uint32_t bit_length);
};
}  // namespace Stml4
}  // namespace LBR